#pragma once
#ifndef __TETRIS_H__
#define __TETRIS_H__

#define BLOCK_KIND   5
#define BLOCK_HEIGHT 5
#define BLOCK_WIDTH  5
#define UNIT_SIZE    20

#define START_X 130
#define START_Y 30

#define KEY_UP    72
#define KEY_LEFT  75
#define KEY_DOWN  80
#define KEY_RIGHT 77
#define KEY_SPACE 32

#define MIN_X 30
#define MIN_Y 30

#define isValid(x,y) (x >= 0 && x < 30 && y >= 0 && y < 15)

int Rank = 0;
int Score = 0;

int Gamearea[30][15];

int CurrentIndex = -1;
int NextIndex    = -1;
//方块的颜色
int Color[BLOCK_KIND + 1] = {
	LIGHTRED,BLUE,YELLOW,BROWN,GREEN,WHITE
};
typedef enum  {
	UP,
	LEFT,
	DOWN,
	RIGHT
}_Block_Dir;
typedef enum {
	MOVE_UP,
	MOVE_LEFT,
	MOVE_DOWN,
	MOVE_RIGHT
}_Move_Dir;

//表示方块的样式
int block[BLOCK_KIND * 4][BLOCK_HEIGHT][BLOCK_WIDTH] = {
	// | 型方块
	{0,0,0,0,0,
	 0,0,1,0,0,
	 0,0,1,0,0,
	 0,0,1,0,0,
	 0,0,0,0,0,},//向上

	{0,0,0,0,0,
	 0,0,0,0,0,
	 0,1,1,1,0,
	 0,0,0,0,0,
	 0,0,0,0,0,},//向左

	{0,0,0,0,0,
	 0,0,1,0,0,
	 0,0,1,0,0,
	 0,0,1,0,0,
	 0,0,0,0,0,},//向下

	{0,0,0,0,0,
	 0,0,0,0,0,
	 0,1,1,1,0,
	 0,0,0,0,0,
	 0,0,0,0,0,},//向右
	//T型方块
	{0,0,0,0,0,
	 0,0,1,0,0,
	 0,1,1,1,0,
	 0,0,0,0,0,
	 0,0,0,0,0,},

	{0,0,0,0,0,
	 0,0,1,0,0,
	 0,1,1,0,0,
	 0,0,1,0,0,
	 0,0,0,0,0,},

	{0,0,0,0,0,
	 0,0,0,0,0,
	 0,1,1,1,0,
	 0,0,1,0,0,
	 0,0,0,0,0,},

	{0,0,0,0,0,
	 0,0,1,0,0,
	 0,0,1,1,0,
	 0,0,1,0,0,
	 0,0,0,0,0,},
	 //田字形
	{0,0,0,0,0,
	 0,1,1,0,0,
	 0,1,1,0,0,
	 0,0,0,0,0,
	 0,0,0,0,0,},

	{0,0,0,0,0,
	 0,1,1,0,0,
	 0,1,1,0,0,
	 0,0,0,0,0,
	 0,0,0,0,0,},

	{0,0,0,0,0,
	 0,1,1,0,0,
	 0,1,1,0,0,
	 0,0,0,0,0,
	 0,0,0,0,0,},

	{0,0,0,0,0,
	 0,1,1,0,0,
	 0,1,1,0,0,
	 0,0,0,0,0,
	 0,0,0,0,0,},
	 //L型
	{0,0,0,0,0,
	 0,0,1,0,0,
	 0,0,1,0,0,
	 0,0,1,1,0,
	 0,0,0,0,0,},

	{0,0,0,0,0,
	 0,0,0,0,0,
	 0,1,1,1,0,
	 0,1,0,0,0,
	 0,0,0,0,0,},

	{0,0,0,0,0,
	 0,0,1,1,0,
	 0,0,1,0,0,
	 0,0,1,0,0,
	 0,0,0,0,0,},

	{0,0,0,0,0,
	 0,0,0,0,0,
	 0,1,1,1,0,
	 0,0,0,1,0,
	 0,0,0,0,0,},
	 //Z型
	{0,0,0,0,0,
	 0,1,1,0,0,
	 0,0,1,1,0,
	 0,0,0,0,0,
	 0,0,0,0,0,},

	{0,0,0,0,0,
	 0,0,1,0,0,
	 0,1,1,0,0,
	 0,1,0,0,0,
	 0,0,0,0,0,},

	{0,0,0,0,0,
	 0,1,1,0,0,
	 0,0,1,1,0,
	 0,0,0,0,0,
	 0,0,0,0,0,},

	{0,0,0,0,0,
	 0,0,1,0,0,
	 0,1,1,0,0,
	 0,1,0,0,0,
	 0,0,0,0,0,},

};

void Welcome();
void initGameScene();
void nextBlock();
void drawBlock(int x, int y);
void clearBlock();

#endif // !__TETRIS_H__
